vehicle = {
    # пожарные
    'Требуемые пожарные машины':
        {'АЦ-3,0-40', 'ПСА', 'АЦЛ', 'АЦ 2,3-40'},
    'Требуемые машины командира батальона':
        {'Штабной автомобиль', 'ПКП'},
    'Требуемые машины для спасательных работ в тяжёлых условиях':
        {'ПСА', 'АБР-5'},
    'Требуемые автомобили обезвреживания':
        {'АПТ-5,0-70'},
    'Требуемые цистерны с водой':
        {'АЦ-9,4-60'},
    'Требуемые мобильные командные пункты':
        {'ПКП'},
    'Требуемые платформы':
        {'АЛ-42', 'АЦЛ'},
    'Требуются автомобили респираторной поддержки':
        {'АРП'},
    'Требуемые пожарные автомобили пенного тушения':
        {'Прицеп с насосной станцией'},
    'Требуемые насосные станции':
        {'Прицеп с насосной станцией'},
    'Требуется вода':
        {'ПСА', 'АЦ-9,4-60', 'АЦ-3,0-40', 'АЦ 2,3-40'},
    'Требуется пена':
        {'ПСА', 'Прицеп с насосной станцией'},
    # полиция
    'Требуемые полицейские автомобили':
        {'Полицейская машина', 'Полицейский мотоцикл'},
    'Нужен полицейский вертолет':
        {'Полицейский вертолет'},
    'Нужны полицейские собаки':
        {'Автомобиль с полицейской собакой'},
    'Требуемый персонал спецназа (в машинах спецназа)':
        {'Бронемашина спецназа', 'Внедорожник спецназа'},
    # скорая
    'Необходим автомобиль мед. координатора':
        {'Автомобиль мед. координатора'},
    'Требуемые скорые':
        {'Машина Скорой Помощи'},

}

vehicle_to_find = ['Требуемые машины командира батальона', 'Требуемые пожарные машины',
                   'Автомобиль с полицейской собакой', 'Требуется вода', "Требуется пена"]